# Объявляем переменные
# Имя пользователя
username = "Петров Петр Петрович"
# Заголовок заметки
title = "Учеба"
# Описание заметки
content = "Учиться! Учиться! И учиться!"
# Статус заметки
status = "Активна"
# Дата создания заметки в формате "день-месяц-год", например "10-11-2024"
created_date = "10-12-2024"
# Дата истечения заметки (дедлайн) в формате "день-месяц-год", например "10-12-2024"
issue_date = "01-12-2025"

# Вывод значений переменных
print("Имя пользователя:", username)
print("Заголовок заметки:", title)
print("Описание заметки:", content)
print("Статус заметки:", status)
print("Дата создания заметки:", created_date)
print("Дата истечения заметки:", issue_date)
